// ==========================================================================================
// Маршрути для клієнтів
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import { getCustomers } from '../controllers/customersController.js';

// Імпорт middleware перевірки аутентифікації
// import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /customers - Отримання списку клієнтів
// -------------------------------------------------------------------------------------------
router.get('/customers', getCustomers);
// ===========================================================================================

// Експорт роутера
export default router;
