// ==========================================================================================
// Маршрути для замовлень - orders
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import { getOrders } from '../controllers/ordersController.js';

// Імпорт middleware перевірки аутентифікації
// import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /orders - Отримання списку замовлень
// -------------------------------------------------------------------------------------------
router.get('/orders', getOrders);
// ===========================================================================================

// Експорт роутера
export default router;
