// ==========================================================================================
// Маршрути для продуктів - products
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import { getProducts } from '../controllers/productsController.js';

// Імпорт middleware перевірки аутентифікації
// import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /products - Отримання списку продуктів
// -------------------------------------------------------------------------------------------
router.get('/products', getProducts);
// ===========================================================================================

// Експорт роутера
export default router;
