// ==========================================================================================
// Маршрути
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import { getSuppliers } from '../controllers/suppliersController.js';

// Імпорт middleware перевірки аутентифікації
// import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /suppliers - Отримання списку постачальників
// -------------------------------------------------------------------------------------------
router.get('/suppliers', getSuppliers);
// ===========================================================================================

// Експорт роутера
export default router;
