// ==========================================================================================
// Маршрути для постачальників - suppliers
// ==========================================================================================

// Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
import { Router } from 'express';

// Імпорт контролерів
import {
  getSuppliers,
  getSupplierById,
  createSupplier,
  updateSupplier,
  deleteSupplier,
} from '../controllers/suppliersController.js';

// celebrate — це middleware для Express, який обгортає Joi та спрощує валідацію в маршрутах.
import { celebrate } from 'celebrate';

// Імпорт схем валідації
import { supplierIdParamSchema } from '../validations/suppliersValidation.js';

// Імпорт middleware перевірки аутентифікації
// import { authenticate } from '../middleware/authenticate.js';

// Створення роутеру
const router = Router();

// ===========================================================================================
// GET /suppliers - Отримання списку постачальників
// -------------------------------------------------------------------------------------------
router.get('/suppliers', getSuppliers);
// ===========================================================================================

// ===========================================================================================
// GET /suppliers/:supplierId - Отримання інформації щодо одного постачальника за його Id
// -------------------------------------------------------------------------------------------
router.get('/suppliers/:supplierId', celebrate(supplierIdParamSchema), getSupplierById);
// ===========================================================================================

// ===========================================================================================
// POST /suppliers - Додавання нового постачальника
// -------------------------------------------------------------------------------------------
router.post('/suppliers', createSupplier);
// ===========================================================================================

// ===========================================================================================
// PUT /suppliers/:supplierId - Редагування даних постачальника
// -------------------------------------------------------------------------------------------
router.put('/suppliers/:supplierId', celebrate(supplierIdParamSchema), updateSupplier);
// ===========================================================================================

// ===========================================================================================
// DELETE /suppliers/:supplierId - Видалення постачальника
// -------------------------------------------------------------------------------------------
router.delete('/suppliers/:supplierId', celebrate(supplierIdParamSchema), deleteSupplier);
// ===========================================================================================

// Експорт роутера
export default router;
