// ===========================================================================================
// Контролери для роботи з клієнтами - customer
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт моделі Сustomer
import { Customer } from '../models/customer.js';

// ===========================================================================================
// GET /customers - Отримання списку клієнтів
// ===========================================================================================
export const getCustomers = async (req, res, next) => {
  try {
    // Пошук в колекції customers - сортування за ім'ям
    const customers = await Customer.find().sort({ name: 1 });

    // Якщо клієнтів немає
    if (!customers) {
      throw createHttpError(404, 'Customers not found');
    }

    // Повертаємо дані зі списком клієнтів
    res.status(200).json({ customers });
  } catch (error) {
    next(error);
  }
};
// ===========================================================================================
