// ===========================================================================================
// Контролери для роботи з замовленнями - order
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт моделі Order
import { Order } from '../models/order.js';

// ===========================================================================================
// GET /orders - Отримання списку замовлень
// ===========================================================================================
export const getOrders = async (req, res, next) => {
  try {
    // Пошук в колекції orders - сортування за іменем
    const orders = await Order.find().sort({ name: 1 });

    // Якщо замовлень немає
    if (!orders) {
      throw createHttpError(404, 'Products not found');
    }

    // Повертаємо дані зі списком замовлень
    res.status(200).json({ orders });
  } catch (error) {
    next(error);
  }
};
// ===========================================================================================
