// ===========================================================================================
// Контролери для роботи з продуктами - product
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт моделі Product
import { Product } from '../models/product.js';

// ===========================================================================================
// GET /products - Отримання списку продуктів
// ===========================================================================================
export const getProducts = async (req, res, next) => {
  try {
    // Пошук в колекції products - сортування за ім'ям
    const products = await Product.find().sort({ name: 1 });

    // Якщо продуктів немає
    if (!products) {
      throw createHttpError(404, 'Products not found');
    }

    // Повертаємо дані зі списком продуктів
    res.status(200).json({ products });
  } catch (error) {
    next(error);
  }
};
// ===========================================================================================
