// ===========================================================================================
// Контролери для роботи з постачальниками
// -------------------------------------------------------------------------------------------
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді.
// ===========================================================================================

// Імпорт функції для створення помилок з пакету http-errors.
// Він дозволяє створювати помилки з потрібним статусом і повідомленням.
import createHttpError from 'http-errors';

// Імпорт моделі Supplier
import { Supplier } from '../models/supplier.js';

// ===========================================================================================
// GET /suppliers - Отримання списку постачальників
// ===========================================================================================
export const getSuppliers = async (req, res, next) => {
  try {
    // Пошук в колекції suppliers - сортування за іменем
    const suppliers = await Supplier.find().sort({ name: 1 });

    // Якщо постачальників немає
    if (!suppliers) {
      throw createHttpError(404, 'Suppliers not found');
    }

    // Повертаємо дані зі списком постачальників
    res.status(200).json({ suppliers });
  } catch (error) {
    next(error);
  }
};
// ===========================================================================================
