// ===============================================================================================
// Схема та модель для колекції "customers" у MongoDB
// ===============================================================================================

// -----------------------------------------------------------------------------------------------
// Пояснення
// type — тип даних (String, Number, Boolean).
// required — чи поле обов’язкове.
// trim: true — автоматично видаляє зайві пробіли на початку та в кінці рядка.
//       Корисно для текстових полів, таких як name, щоб уникнути збереження значень на кшталт " John ".
// enum — перелік допустимих значень (наприклад, для gender).
// default — значення за замовчуванням, якщо поле не передано.
// timestamps — автоматично додає createdAt і updatedAt.
// versionKey: false — вимикає службове поле __v.
// -----------------------------------------------------------------------------------------------
//  Cхема для моделі Customer із такими властивостями:
//   {
//      "name": "Nadia Ivanova",
//      "email": "nadia.ivanova@gmail.com",
//      "photo": "https://i.imgur.com/1As0akH.png1",
//      "spent": "2,300.50",
//      "phone": "+380707614324",
//      "address": "Obolon, Bldg. 10, Apt. 45",
//      "register_date": "Mar 1, 2024"
//    },
// -----------------------------------------------------------------------------------------------

// Імпорт Schema та model
import { Schema, model } from 'mongoose';

// Створення схеми колекції
const customerSchema = new Schema(
  {
    name: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    email: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    photo: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    spent: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    phone: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    address: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    register_date: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
  },
  {
    timestamps: false, // автоматично додає createdAt і updatedAt
    versionKey: false, // вимикає службове поле __v
  },
);

// Индексація в моделі, може включати кілька полів.
//    - за ім'ям, сортування за зростанням
// === supplierSchema.index({ title: 1, category: 1 });
customerSchema.index({ name: 1 });

// Текстовий індекс - за ім'ям
// text index може бути тільки один на колекцію, але він може включати кілька полів.
// === supplierSchema.index({ title: 'text', description: 'text' });
customerSchema.index({ name: 'text' });

// Створюємо модель згідно схеми
export const Customer = model('Customer', customerSchema);
