// ===============================================================================================
// Схема та модель для колекції "orders" у MongoDB
// ===============================================================================================

// -----------------------------------------------------------------------------------------------
// Пояснення
// type — тип даних (String, Number, Boolean).
// required — чи поле обов’язкове.
// trim: true — автоматично видаляє зайві пробіли на початку та в кінці рядка.
//       Корисно для текстових полів, таких як name, щоб уникнути збереження значень на кшталт " John ".
// enum — перелік допустимих значень (наприклад, для gender).
// default — значення за замовчуванням, якщо поле не передано.
// timestamps — автоматично додає createdAt і updatedAt.
// versionKey: false — вимикає службове поле __v.
// -----------------------------------------------------------------------------------------------
//  Cхема для моделі Order із такими властивостями:
//   {
//      "photo": "https://i.imgur.com/FHMKqK5.png",
//      "name": "Ivan Franko",
//      "address": "Yaroslaviv Val, Bldg. 47, Apt. 194",
//      "products": "09",
//      "price": "530.76",
//      "status": "Pending",
//      "order_date": "July 31, 2023"
//    },
// -----------------------------------------------------------------------------------------------

// Імпорт Schema та model
import { Schema, model } from 'mongoose';

// Створення схеми колекції
const orderSchema = new Schema(
  {
    photo: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    name: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    address: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    products: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    price: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    status: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    order_date: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
  },
  {
    timestamps: false, // автоматично додає createdAt і updatedAt
    versionKey: false, // вимикає службове поле __v
  },
);

// Индексація в моделі, може включати кілька полів.
//    - за ім'ям, сортування за зростанням
// === supplierSchema.index({ title: 1, category: 1 });
orderSchema.index({ name: 1 });

// Текстовий індекс - за ім'ям
// text index може бути тільки один на колекцію, але він може включати кілька полів.
// === supplierSchema.index({ title: 'text', description: 'text' });
// orderSchema.index({ name: 'text' });

// Створюємо модель згідно схеми
export const Order = model('Order', orderSchema);
