// ===============================================================================================
// Схема та модель для колекції "products" у MongoDB
// ===============================================================================================

// -----------------------------------------------------------------------------------------------
// Пояснення
// type — тип даних (String, Number, Boolean).
// required — чи поле обов’язкове.
// trim: true — автоматично видаляє зайві пробіли на початку та в кінці рядка.
//       Корисно для текстових полів, таких як name, щоб уникнути збереження значень на кшталт " John ".
// enum — перелік допустимих значень (наприклад, для gender).
// default — значення за замовчуванням, якщо поле не передано.
// timestamps — автоматично додає createdAt і updatedAt.
// versionKey: false — вимикає службове поле __v.
// -----------------------------------------------------------------------------------------------
//  Cхема для моделі Product із такими властивостями:
//   {
//      "id": "0",
//      "photo": "https://i.ibb.co/bLKP624/5-15-1000x1000-min.jpg",
//      "name": "Aspirin",
//      "suppliers": "Square",
//      "stock": "12",
//      "price": "89.66",
//      "category": "Medicine"
//    },
// -----------------------------------------------------------------------------------------------

// Імпорт Schema та model
import { Schema, model } from 'mongoose';

// Створення схеми колекції
const productSchema = new Schema(
  {
    id: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    photo: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    name: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    suppliers: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    stock: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    price: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    category: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
  },
  {
    timestamps: false, // автоматично додає createdAt і updatedAt
    versionKey: false, // вимикає службове поле __v
  },
);

// Индексація в моделі, може включати кілька полів.
//    - за ім'ям, сортування за зростанням
// === supplierSchema.index({ title: 1, category: 1 });
productSchema.index({ name: 1 });

// Текстовий індекс - за ім'ям
// text index може бути тільки один на колекцію, але він може включати кілька полів.
// === supplierSchema.index({ title: 'text', description: 'text' });
// productSchema.index({ name: 'text' });

// Створюємо модель згідно схеми
export const Product = model('Product', productSchema);
