// ===============================================================================================
// Схема та модель для колекції "recipes" у MongoDB
// ===============================================================================================
// -----------------------------------------------------------------------------------------------
// Пояснення
// type — тип даних (String, Number, Boolean).
// required — чи поле обов’язкове.
// trim: true — автоматично видаляє зайві пробіли на початку та в кінці рядка.
// Корисно для текстових полів, таких як name, щоб уникнути збереження значень на кшталт " John ".
// enum — перелік допустимих значень (наприклад, для gender).
// default — значення за замовчуванням, якщо поле не передано.
// timestamps — автоматично додає createdAt і updatedAt.
// versionKey: false — вимикає службове поле __v.
// -----------------------------------------------------------------------------------------------

// Імпорт Schema та model
import { Schema, model } from 'mongoose';

//  Cхема для моделі Supplier із такими властивостями:
//   {
//     "name": "Alex Shatov",
//     "address": "Mripur-1",
//     "suppliers": "Square",
//     "date": "September 19, 2023",
//     "amount": "а§і 6952.53",
//     "status": "Active"
// },

const supplierSchema = new Schema(
  {
    name: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    address: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    suppliers: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    date: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    amount: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
    status: {
      type: String,
      required: true, // робить поле обов'язковим для заповнення
      trim: true, // прибирає пробіли на початку та в кінці рядка
    },
  },
  {
    timestamps: true, // автоматично додає createdAt і updatedAt
    versionKey: false, // вимикає службове поле __v
  },
);

// Индексація в моделі, може включати кілька полів.
//    - за ім'ям, сортування за зростанням
// supplierSchema.index({ title: 1, category: 1 });
supplierSchema.index({ name: 1 });

// Текстовий індекс - за ім'ям
// text index може бути тільки один на колекцію, але він може включати кілька полів.
// supplierSchema.index({ title: 'text', description: 'text' });
supplierSchema.index({ name: 'text' });

// Створюємо модель згідно схеми
export const Supplier = model('Supplier', supplierSchema);
